tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/cask-versions'

# env
brew 'coreutils'
brew 'vim', args: ['with-lua', 'with-luajit', 'with-python3']

# shell
brew 'curl'
brew 'fzf'
brew 'httpie'
brew 'hub'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'zsh'
cask 'iterm2'

# git
brew 'git'
brew 'tig'

# java
cask 'java'
cask 'java8'
brew 'gradle'

# scala
brew 'scala', args: ['with-docs', 'with-src']
brew 'sbt'

# haskell
cask 'haskell-platform'

# swift
tap 'kylef/formulae'
brew 'kylef/formulae/swiftenv'

# node
brew 'nvm'

# ios
cask 'fastlane'

# server
brew 'mysql'

# docker
brew 'docker'
brew 'docker-machine'
brew 'docker-machine-nfs'
brew 'docker-compose'
brew 'kubernetes-cli'
cask 'docker'
cask 'minikube'

# cloud
brew 'doctl' # digital ocean
brew 'awscli'
brew 'aws-elasticbeanstalk'

# caks
cask_args appdir: '/Applications'

# IDEs
cask 'jetbrains-toolbox'

# editors
cask 'atom'
cask 'haroopad'

# browsers
cask 'firefox'
cask 'google-chrome'

# finder
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'

# chat
cask 'skype'
cask 'slack'

# dev
brew 'cocoapods'

# font
tap 'caskroom/fonts'
cask 'font-hack'
cask 'font-fira-code'

# etc
cask 'minecraft'
cask 'virtualbox'
cask 'vlc'
cask '1password'
cask 'karabiner-elements'
