# shell
brew 'curl'
brew 'fzf'
brew 'httpie'
brew 'hub'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'zsh'

# git
brew 'git'
brew 'tig'

# docker
brew 'docker'
brew 'docker-machine'
brew 'docker-machine-nfs'

# caks
cask_args appdir: '/Applications'

# IDEs
cask 'jetbrains-toolbox'

# finder
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'

# font
tap 'caskroom/fonts'
cask 'font-hack'
cask 'font-fira-code'
