tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'

# env
brew 'coreutils'
brew 'vim', args: ['with-lua', 'with-luajit', 'with-python3']

# shell
brew 'curl'
brew 'fzf'
brew 'httpie'
brew 'hub'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'zsh'
cask 'iterm2'

# git
brew 'git', args: ['with-brewed-curl', 'with-brewed-openssl']
brew 'tig'

# java
cask 'java'
brew 'gradle'

# scala
brew 'scala', args: ['with-docs', 'with-src']
brew 'typesafe-activator'

# swift
tap 'kylef/formulae'
brew 'kylef/formulae/swiftenv'

# php
brew 'homebrew/php/composer'
brew 'homebrew/php/boris'

# node
brew 'nvm'

# ruby
brew 'rbenv'

# server
brew 'nginx', args: ['with-spdy']
brew 'mysql'

# docker
brew 'docker'
brew 'docker-machine'
brew 'docker-machine-nfs'
brew 'docker-compose'
cask 'docker'

# cloud
brew 'doctl' # digital ocean
brew 'awscli'

# caks
cask_args appdir: '/Applications'

# IDEs
cask 'intellij-idea'
cask 'phpstorm'

# editors
cask 'atom'
cask 'haroopad'

# browsers
cask 'firefox'

# finder
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'

# chat
cask 'skype'
cask 'slack'

# dev
brew 'cocoapods'

# font
tap 'caskroom/fonts'
cask 'font-hack'

# etc
cask 'minecraft'
cask 'virtualbox'
cask 'vlc'
cask '1password'
cask 'karabiner'
